queens_backend/queens_api/app/controllers/appointments_controller.rb

    def index
        @appointments = Appointment.all.sort
---
SELECT "appointments".* FROM "appointments"

    def create
         @appointment = Appointment.create(appnt_param)
---
INSERT INTO "appointments" ("stylist_id", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stylist_id", 1], ["date", "2020-01-15"], ["time", "01:04"], ["created_at", "2020-01-02 05:08:16.852587"], ["updated_at", "2020-01-02 05:08:16.852587"]]

    def update
        @appointment = Appointment.find(params[:id])
        @appointment.update(appnt_param)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "appointments" SET "stylist_id" = $1, "date" = $2, "updated_at" = $3 WHERE "appointments"."id" = $4  [["stylist_id", 1], ["date", "jan-9-2020"], ["updated_at", "2019-12-30 21:12:07.741695"], ["id", 2]]

    def destroy
        @appointment = Appointment.find(params[:id])
        @appointment.delete
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 24]]