queens_backend/queens_api/app/controllers/stylists_controller.rb

SELECT "stylists".* FROM "stylists"
---
    def index
        @stylists = Stylist.all

SELECT "stylists".* FROM "stylists" WHERE "stylists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "stylists" SET "name" = $1, "updated_at" = $2 WHERE "stylists"."id" = $3  [["name", "hanikeS"], ["updated_at", "2020-01-02 19:46:42.875670"], ["id", 3]]
---
    def update
        @stylist = Stylist.find(params[:id])
        @stylist.update(stylist_param)